{
  "id": "spicy-buffalo-white-chicken-chili",
  "title": "Spicy Buffalo White Chicken Chili",
  "description": "A creamy, spicy white chicken chili with buffalo sauce and poblano peppers. Perfect comfort food with a kick!",
  "cookTime": "30 min",
  "prepTime": "15 min",
  "servings": 6,
  "difficulty": "Medium",
  "style": "American",
  "category": "dinner",
  "source": "halfbakedharvest.com",
  "ingredients": [
    "2 tablespoons extra virgin olive oil",
    "1 medium yellow onion, chopped",
    "2 poblano peppers, seeded and chopped",
    "4 cloves garlic, chopped",
    "1 tablespoon dried parsley",
    "1 tablespoon dried chives",
    "2 teaspoons dried dill",
    "1 teaspoon smoked paprika",
    "kosher salt to taste",
    "black pepper to taste",
    "1 pound boneless skinless chicken breasts or thighs",
    "4 cups low-sodium chicken broth",
    "4 ounces cream cheese, at room temperature",
    "1 can white beans, drained",
    "3/4 cup buffalo sauce",
    "1/2 cup salsa verde",
    "1 cup shredded cheddar cheese",
    "1/2 cup fresh cilantro, chopped",
    "1 avocado for serving",
    "cheddar cheese for serving",
    "Greek yogurt for serving"
  ],
  "instructions": [
    "Heat the olive oil in a large pot over medium heat. Add the onion and poblano peppers and cook until fragrant, about 5 minutes.",
    "Stir in the garlic, parsley, chives, dill, paprika, and a pinch each of salt and pepper. Cook 5 minutes, until very fragrant.",
    "Add the chicken, then stir in 4 cups broth. Season with salt and pepper. Partially cover and simmer over medium-low heat for 20 minutes, until the chicken is cooked through.",
    "Pull the chicken out and shred using 2 forks.",
    "Stir in the cream cheese until smooth, slowly letting it melt into the broth.",
    "Add the shredded chicken, white beans, salsa verde, buffalo sauce, and cheddar cheese. Cook 5-10 minutes, until the cheese is melted.",
    "Remove from the heat and stir in the cilantro. If needed, thin with additional broth.",
    "Ladle the chili into bowls. Top with Greek yogurt or sour cream, cheese, avocado, cilantro, and green onions as desired."
  ],
  "notes": [
    "Buffalo Sauce: Mix 1/2 cup hot sauce, 1/2 cup olive oil or melted butter, 1/2 teaspoon paprika, 1/2 teaspoon smoked paprika, and 1/2 teaspoon each onion powder, garlic powder, salt, and pepper.",
    "For crockpot version: Combine onion, poblano peppers, garlic, herbs and spices in crockpot. Add chicken, 4 cups broth and cream cheese. Season with salt and pepper. Cook on low for 6-7 hours or high for 4-5 hours. Shred chicken and stir in beans, salsa verde, buffalo sauce, cheddar, and cilantro.",
    "Can use more broth (up to 6 cups) for a thinner consistency."
  ]
}
